#+title: Introduction to Functional Programming with Haskell
#+author: Jonathan Reeve
#+email: jonathan.reeve@columbia.edu

This workshop was originally given via [[https://events.columbia.edu/cal/event/showEventMore.rdo][Columbia University's Foundations for Research Computing]] program.

* Some Haskell syntax

Function application uses spaces.
 - The first word is the function name
 - Every other word is given to that function as input
  
#+BEGIN_SRC haskell
tip = (*) 0.2
tip 30
#+END_SRC

#+RESULTS:
: 6.0

#+BEGIN_SRC python
def tip(mealPrice):
    return mealPrice * 0.2
print(tip(30))
#+END_SRC

#+RESULTS:
: None

Function arguments are named before the ~=~ sign:

#+BEGIN_SRC haskell
withTip price = price + (tip price)
withTip 30
#+END_SRC

#+RESULTS:
: 36.0

Which is equivalent to this in Python:

#+BEGIN_SRC python :results output
def withTip(price):
    return price + (price * 0.2)
print(withTip(30))
#+END_SRC

#+RESULTS:
: 36.0


#+BEGIN_SRC haskell
circleArea r = pi * r ** 2
circleArea 5
#+END_SRC

#+RESULTS:
: 78.53981633974483

There are no ~for~ loops in Haskell.

So how do you iterate over something? Write a function, and ~map~ that function over a list.

#+BEGIN_SRC haskell
mealPrices = [30, 32, 40, 35]
map withTip mealPrices
#+END_SRC

#+RESULTS:
| 36.0 | 38.4 | 48.0 | 42.0 |

In Python, this would be:

#+BEGIN_SRC python :results output
mealPrices = [30, 32, 40, 35]

def withTip(mealPrice):
    return mealPrice + (mealPrice * 0.2)

tipsAdded = []
for meal in mealPrices:
    tipsAdded.append(withTip(meal))

tipsAdded = [withTip(meal) for tip in mealPrices]

print(tipsAdded)
#+END_SRC

#+RESULTS:
: [36.0, 38.4, 48.0, 42.0]

#+BEGIN_SRC haskell
zip [1..5] [10..15]
#+END_SRC

#+RESULTS:
| 1 | 10 |
| 2 | 11 |
| 3 | 12 |
| 4 | 13 |
| 5 | 14 |

Add two lists together pairwise:

#+BEGIN_SRC haskell
zipWith (+) [1..5] [10..15]
#+END_SRC

#+RESULTS:
| 11 | 13 | 15 | 17 | 19 |

Infinite lists! (Laziness FTW)

#+BEGIN_SRC haskell
take 10 [100..]
#+END_SRC

#+RESULTS:
| 100 | 101 | 102 | 103 | 104 | 105 | 106 | 107 | 108 | 109 |

Thus the Fibonnacci sequence:

#+BEGIN_SRC haskell
fibonacci = 0 : 1 : zipWith (+) fibonacci (tail fibonacci)

take 20 fibonacci
#+END_SRC

#+RESULTS:
: Prelude> [0,1,1,2,3,5,8,13,21,34,55,89,144,233,377,610,987,1597,2584,4181]

* Working with strings:

#+BEGIN_SRC haskell
hammerTime = "Can't touch this. Da na na na."
words hammerTime
#+END_SRC

#+RESULTS:
| Can't | touch | this. | Da | na | na | na. |

How many words is that? Use function composition.

#+BEGIN_SRC haskell
(length . words) hammerTime
#+END_SRC

#+RESULTS:
: 7

Or map it:

#+BEGIN_SRC haskell
map length (words hammerTime)
#+END_SRC

#+RESULTS:
| 5 | 5 | 5 | 2 | 2 | 2 | 3 |

#+BEGIN_SRC haskell
:t hammerTime
#+END_SRC

#+RESULTS:
: <interactive>:1:1-10: error: Variable not in scope: hammerTime

#+BEGIN_SRC haskell
:t hammerTime
#+END_SRC

* Everything is a function

The type signature says: it takes two parameters: a function ~(a -> a)~ and something else ~a~, and returns something ~a~.

#+BEGIN_SRC haskell
doTwice f x = f (f x)

hammer = (++ " Hammertime!")
doTwice hammer "Can't touch this."
#+END_SRC

#+RESULTS:
: Prelude> Prelude> "Can't touch this. Hammertime! Hammertime!"

* Filter

#+BEGIN_SRC haskell
isVowel c = elem c "aeiou"

disemvowel = filter (not isVowel)
disemvowel hammerTime
#+END_SRC

#+RESULTS:
: <interactive>:16:1-10: error:
:     Variable not in scope: disemvowel :: t0 -> t
:
: <interactive>:16:12-21: error: Variable not in scope: hammerTime

* Types and type signatures

http://www.happylearnhaskelltutorial.com/1/types_jigsaw.html#s3

#+BEGIN_SRC haskell
:t isVowel
#+END_SRC

#+RESULTS:
: isVowel :: Char -> Bool

#+BEGIN_SRC haskell
:t disemvowel
#+END_SRC

#+RESULTS:
: disemvowel :: [Char] -> [Char]

#+BEGIN_SRC haskell
:t withTip
#+END_SRC

#+RESULTS:
: withTip :: Fractional a => a -> a

#+BEGIN_SRC haskell
:t doTwice
#+END_SRC

#+RESULTS:
: doTwice :: (t -> t) -> t -> t

* IO

Haskell distinguishes between functions which operate on values, and ~actions~ which handle IO.

#+BEGIN_SRC haskell
main = do
  putStrLn "Please enter your name:"
  name <- getLine
  putStrLn ("Hello, " ++ name ++ ", how are you?")

#+END_SRC


#+BEGIN_SRC haskell
:t putStrLn
#+END_SRC

#+RESULTS:
: putStrLn :: String -> IO ()

#+BEGIN_SRC haskell
:t getLine
#+END_SRC

#+RESULTS:
: getLine :: IO String

* Make your own types

#+BEGIN_SRC haskell :session newSession
data GroceryItem = Oats | Milk | Oatmilk | Oranges | OrangeJuice deriving Show
type Quantity = Int
data ShoppingList = ShoppingList [(GroceryItem, Quantity)] deriving Show

myShoppingList = ShoppingList [(Oats, 2), (Milk, 1), (Oatmilk, 3), (Oranges, 25)]

countInList :: ShoppingList -> Quantity

main = print myShoppingList
#+END_SRC

#+RESULTS:
: Prelude>
: <interactive>:133:10-23: error:
:     Variable not in scope: myShoppingList :: String
